//
//  DataSource.swift
//  scrollViewTest
//
//  Created by Cara Brennan on 9/18/18.
//  Copyright © 2018 Cara Brennan. All rights reserved.
//

import Foundation

public class DataSource {

    public var json =  [
        ["id": 0,
         "network_name": "Winter",
         "programs": ["❄️❄️", "☃️☃️☃️", "🎄🎄🎄🎄🎄🎄", "🧝🏽‍♀️", "🐧🐧🐧🐧", "🐺🐺🐺🐺🐺", "🥔🥘🥔🥘", "🍾🍾🍾"] ],
        ["id": 1,
         "network_name": "Spring",
         "programs": ["🐛🐛🐛", "👒", "🌷🌷🌷🌷🌷🌷", "☔️", "🌸🌸🌸🌸🌸", "🌈🌈🌈", "🌨🌨🌨🌨"] ],
        ["id": 2,
         "network_name": "Summer",
         "programs": ["🏐🏐🏐🏐", "🏖", "🎢🎢", "🏄🏿‍♀️🏄🏿‍♀️🏄🏿‍♀️🏄🏿‍♀️🏄🏿‍♀️", "🍉🍉🍉", "🌞🌞🌞🌞🌞🌞", "🌴"]],
        ["id": 3,
         "network_name": "Fall",
         "programs": ["🍎🍎🍎🍎", "🍂", "☕️☕️☕️☕️", "🏈", "🍁🍁🍁", "🌽🥕", "📕📙📒📗📘", "🎃🎃🎃🎃🎃"],
         ],
        ["id" : 4,
         "network_name": "Ocean",
         "programs": ["🐳", "🐬🐬", "🐟🐟🐟", "🐠🐠🐠🐠🐠🐠", "🐚🐚", "⛵️", "⚓️⚓️⚓️⚓️⚓️", "☠️☠️☠️"]
        ],
        ["id": 5,
         "network_name": "Garden",
         "programs": ["😻", "🎍🎍", "🌻🌻🌻🌻", "🥦🥦🥦", "🥒🥒🥒🥒", "🐿", "💐💐","🌏🌏🌏🌏🌏" ]
        ],
        ["id": 5,
         "network_name": "Cooking",
         "programs": ["🍄🥐", "🌯🍥🌯🍥🌯🍥🌯🍥", "🎂🎂", "🥣🥣🥣", "🚰","📖📖📖📖","👨🏽‍🍳👨🏽‍🍳👨🏽‍🍳👨🏽‍🍳👨🏽‍🍳👨🏽‍🍳" ]
        ],
        ["id": 6,
         "network_name": "Mammals",
         "programs": ["😻😻", "🧟‍♀️", "🐋🦍🐋🦍🐋🦍", "🐒", "🐯🐯🐯", "🐰🏊🏾‍♂️🐰🏊🏾‍♂️🐰🏊🏾‍♂️🐰🏊🏾‍♂️🐰🏊🏾‍♂️🐰🏊🏾‍♂️","🐹🐹🐹🐹🐹🐹"]
        ],
        ["id": 7,
         "network_name": "Flowers",
         "programs": ["🌸🌸🌸🌸", "🌼🌼🌼", "🌻", "🌷🌻🌷🌻🌷", "💐🌺","🥀💐🌺🥀💐🌺🥀🌹"]
        ],
        ["id": 8,
         "network_name": "Dessert",
         "programs": ["🍧🍧🍧","🍦🍦🍦🍦🍦🍦🍦","🥧🍰🥧🍰","🎂","🍮🍭🍮🍭🍮🍭🍮🍭", "🍩","🍫🍫🍫🍫", "🍬🍬🍬🍬"]
        ],
        ["id": 9,
         "network_name": "Vegetables",
         "programs":[ "🥗🥗🥗🥗","🍄🥒🍄🥒🍄🥒🍄🥒🍄🥒🍄🥒","🥦🍆","🍠🍠🍠🍠🍠🍠🍠","🌽🌽🌽","🌶🥕"]
        ]        ]

}



